contiki-os/contiki/cc26xxware/driverlib/setup.c
            while ( i32CustomerDeltaAdjust < 0 ) {
                ui32XoscHfCol >>= 1;                              // COL 1 step down
                if ( ui32XoscHfCol == 0 ) {                       // if COL below minimum
                    ui32XoscHfCol = 0xFFFF;                       //   Set COL to maximum
                    ui32XoscHfRow >>= 1;                          //   ROW 1 step down
                    if ( ui32XoscHfRow == 0 ) {                   // if ROW below minimum
                       ui32XoscHfRow = 1;                         //   Set both ROW and COL
                       ui32XoscHfCol = 1;                         //   to minimum
                    }
                }
                i32CustomerDeltaAdjust++;
            }
            while ( i32CustomerDeltaAdjust > 0 ) {
                ui32XoscHfCol = ( ui32XoscHfCol << 1 ) | 1;       // COL 1 step up
                if ( ui32XoscHfCol > 0xFFFF ) {                   // if COL abowe maximum
                    ui32XoscHfCol = 1;                            //   Set COL to minimum
                    ui32XoscHfRow = ( ui32XoscHfRow << 1 ) | 1;   //   ROW 1 step up
                    if ( ui32XoscHfRow > 0xF ) {                  // if ROW abowe maximum
                       ui32XoscHfRow = 0xF;                       //   Set both ROW and COL
                       ui32XoscHfCol = 0xFFFF;                    //   to maximum
                    }
                }
                i32CustomerDeltaAdjust--;
            }
        }

        ui32TrimValue = (( ui32XoscHfRow << DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_ROW_Q12_S    ) |
                         ( ui32XoscHfCol << DDI_0_OSC_ANABYPASSVAL1_XOSC_HF_COLUMN_Q12_S )   );
    }

    return (ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value to be used for the RCOSCLF_RTUNE_TRIM and the
//! RCOSCLF_CTUNE_TRIM bit fields in the XOSCLF_RCOSCLF_CTRL register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForRcOscLfRtuneCtuneTrim(uint32_t ui32Fcfg1Revision)
{
    uint32_t ui32TrimValue;

    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim value
        ui32TrimValue = 0x00D8;
    } else {
        // Use device specific trim values located in factory configuration
        // area
        ui32TrimValue =
            ((HWREG(FCFG1_BASE + FCFG1_O_CONFIG_OSC_TOP) &
              FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_M)>>
              FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_S)<<
                DDI_0_OSC_LFOSCCTL_RCOSCLF_CTUNE_TRIM_S;

        ui32TrimValue |=
            ((HWREG(FCFG1_BASE + FCFG1_O_CONFIG_OSC_TOP) &
              FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_M)>>
              FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_S)<<
                DDI_0_OSC_LFOSCCTL_RCOSCLF_RTUNE_TRIM_S;
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value to be used for the XOSC_HF_IBIASTHERM bit field in
//! the ANABYPASS_VALUE2 register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForXoscHfIbiastherm(uint32_t ui32Fcfg1Revision)
{
    uint32_t ui32TrimValue;

    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim value
        ui32TrimValue = 0x03FF;
    } else {
        // Use device specific trim value located in factory configuration
        // area
        ui32TrimValue =
            (HWREG(FCFG1_BASE + FCFG1_O_ANABYPASS_VALUE2) &
             FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_M)>>
             FCFG1_ANABYPASS_VALUE2_XOSC_HF_IBIASTHERM_S;
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value to be used for the AMPCOMP_TH2 register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForAmpcompTh2(uint32_t ui32Fcfg1Revision)
{
    uint32_t ui32TrimValue;
    uint32_t ui32Fcfg1Value;

    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim values
        ui32TrimValue = 0x68880000;
    } else {
        // Use device specific trim value located in factory configuration
        // area. All defined register bit fields have corresponding trim
        // value in the factory configuration area
        ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_AMPCOMP_TH2);
        ui32TrimValue = ((ui32Fcfg1Value &
                          FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_M)>>
                          FCFG1_AMPCOMP_TH2_LPMUPDATE_LTH_S)<<
                       DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_LTH_S;
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_M)>>
                            FCFG1_AMPCOMP_TH2_LPMUPDATE_HTM_S)<<
                         DDI_0_OSC_AMPCOMPTH2_LPMUPDATE_HTH_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_M)>>
                            FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_LPM_S)<<
                         DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_LPM_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_M)>>
                            FCFG1_AMPCOMP_TH2_ADC_COMP_AMPTH_HPM_S)<<
                         DDI_0_OSC_AMPCOMPTH2_ADC_COMP_AMPTH_HPM_S);
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value to be used for the AMPCOMP_TH1 register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForAmpcompTh1(uint32_t ui32Fcfg1Revision)
{
    uint32_t ui32TrimValue;
    uint32_t ui32Fcfg1Value;

    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim values
        ui32TrimValue = 0x0068768A;
    } else {
        // Use device specific trim values located in factory configuration
        // area. All defined register bit fields have a corresponding trim
        // value in the factory configuration area
        ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_AMPCOMP_TH1);
        ui32TrimValue = (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_M)>>
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_S)<<
                         DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_LTH_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_M)>>
                            FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_S)<<
                         DDI_0_OSC_AMPCOMPTH1_HPMRAMP3_HTH_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_M)>>
                            FCFG1_AMPCOMP_TH1_IBIASCAP_LPTOHP_OL_CNT_S)<<
                         DDI_0_OSC_AMPCOMPTH1_IBIASCAP_LPTOHP_OL_CNT_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_M)>>
                            FCFG1_AMPCOMP_TH1_HPMRAMP1_TH_S)<<
                         DDI_0_OSC_AMPCOMPTH1_HPMRAMP1_TH_S);
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value to be used for the AMPCOMP_CTRL register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForAmpcompCtrl(uint32_t ui32Fcfg1Revision)
{
    uint32_t ui32TrimValue    ;
    uint32_t ui32Fcfg1Value   ;
    uint32_t ibiasOffset      ;
    uint32_t ibiasInit        ;
    uint32_t modeConf1        ;
    int32_t  deltaAdjust      ;

