contiki-os/contiki/cc26xxware/driverlib/setup.c
    if ( ui32Fcfg1Revision == 0 ) {
        // Use hardcoded trim values
        ui32TrimValue = 0x00713F27;
    } else {
        // Use device specific trim valuse loacted in factory configuration
        // area. Register bit fields without trim values in the factory
        // configuration area will be set to the value of 0.
        ui32Fcfg1Value = HWREG( FCFG1_BASE + FCFG1_O_AMPCOMP_CTRL1 );

        ibiasOffset    = ( ui32Fcfg1Value &
                           FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_M ) >>
                           FCFG1_AMPCOMP_CTRL1_IBIAS_OFFSET_S ;
        ibiasInit      = ( ui32Fcfg1Value &
                           FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_M ) >>
                           FCFG1_AMPCOMP_CTRL1_IBIAS_INIT_S ;

        if (( HWREG( CCFG_BASE + CCFG_O_SIZE_AND_DIS_FLAGS ) & CCFG_SIZE_AND_DIS_FLAGS_DIS_XOSC_OVR_M ) == 0 ) {
            // Adjust with DELTA_IBIAS_OFFSET and DELTA_IBIAS_INIT from CCFG
            modeConf1   = HWREG( CCFG_BASE + CCFG_O_MODE_CONF_1 );

            // Both fields are signed 4-bit values. This is an assumption when doing the sign extention.
            deltaAdjust = (int32_t)modeConf1 << ( 32 - CCFG_MODE_CONF_1_DELTA_IBIAS_OFFSET_S - 4 ) >> 28;
            deltaAdjust += (int32_t)ibiasOffset;
            if ( deltaAdjust < 0 ) {
               deltaAdjust = 0;
            }
            if ( deltaAdjust > ( DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S )) {
                deltaAdjust  = ( DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S );
            }
            ibiasOffset = (uint32_t)deltaAdjust;

            deltaAdjust = (int32_t)modeConf1 << ( 32 - CCFG_MODE_CONF_1_DELTA_IBIAS_INIT_S - 4 ) >> 28;
            deltaAdjust += (int32_t)ibiasInit;
            if ( deltaAdjust < 0 ) {
               deltaAdjust = 0;
            }
            if ( deltaAdjust > ( DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S )) {
                deltaAdjust  = ( DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_M >> DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S );
            }
            ibiasInit = (uint32_t)deltaAdjust;
        }
        ui32TrimValue = ( ibiasOffset << DDI_0_OSC_AMPCOMPCTL_IBIAS_OFFSET_S ) |
                        ( ibiasInit   << DDI_0_OSC_AMPCOMPCTL_IBIAS_INIT_S   ) ;

        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_M)>>
                            FCFG1_AMPCOMP_CTRL1_LPM_IBIAS_WAIT_CNT_FINAL_S)<<
                           DDI_0_OSC_AMPCOMPCTL_LPM_IBIAS_WAIT_CNT_FINAL_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_CTRL1_CAP_STEP_M)>>
                            FCFG1_AMPCOMP_CTRL1_CAP_STEP_S)<<
                           DDI_0_OSC_AMPCOMPCTL_CAP_STEP_S);
        ui32TrimValue |= (((ui32Fcfg1Value &
                            FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_M)>>
                            FCFG1_AMPCOMP_CTRL1_IBIASCAP_HPTOLP_OL_CNT_S)<<
                           DDI_0_OSC_AMPCOMPCTL_IBIASCAP_HPTOLP_OL_CNT_S);

        if ( ui32Fcfg1Revision >= 0x00000022 ) {
            ui32TrimValue |= ((( ui32Fcfg1Value &
                FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_M ) >>
                FCFG1_AMPCOMP_CTRL1_AMPCOMP_REQ_MODE_S ) <<
               DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_S );
        }
    }

    return(ui32TrimValue);
}

//*****************************************************************************
//
//! Returns the trim value from FCFG1 to be used as DBLR_LOOP_FILTER_RESET_VOLTAGE setting
//
//*****************************************************************************
static uint32_t
GetTrimForDblrLoopFilterResetVoltage( uint32_t ui32Fcfg1Revision )
{
   uint32_t dblrLoopFilterResetVoltageValue = 0; // Reset value

   if ( ui32Fcfg1Revision >= 0x00000020 ) {
      dblrLoopFilterResetVoltageValue = ( HWREG( FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1 ) &
         FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_M ) >>
         FCFG1_MISC_OTP_DATA_1_DBLR_LOOP_FILTER_RESET_VOLTAGE_S;
   }

   return ( dblrLoopFilterResetVoltageValue );
}

//*****************************************************************************
//
//! Returns the trim value from FCFG1 to be used as ADC_SH_MODE_EN setting
//
//*****************************************************************************
static uint32_t
GetTrimForAdcShModeEn( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForAdcShModeEnValue = 1; // Recommanded default setting

   if ( ui32Fcfg1Revision >= 0x00000022 ) {
      getTrimForAdcShModeEnValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         FCFG1_OSC_CONF_ADC_SH_MODE_EN_M ) >>
         FCFG1_OSC_CONF_ADC_SH_MODE_EN_S;
   }

   return ( getTrimForAdcShModeEnValue );
}

//*****************************************************************************
//
//! Returns the trim value from FCFG1 to be used as ADC_SH_VBUF_EN setting
//
//*****************************************************************************
static uint32_t
GetTrimForAdcShVbufEn( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForAdcShVbufEnValue = 1; // Recommanded default setting

   if ( ui32Fcfg1Revision >= 0x00000022 ) {
      getTrimForAdcShVbufEnValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         FCFG1_OSC_CONF_ADC_SH_VBUF_EN_M ) >>
         FCFG1_OSC_CONF_ADC_SH_VBUF_EN_S;
   }

   return ( getTrimForAdcShVbufEnValue );
}

//*****************************************************************************
//
//! Returns the trim value to be used for the XOSCHFCTL register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForXoscHfCtl( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForXoschfCtlValue = 0; // Recommanded default setting
   uint32_t fcfg1Data;

   if ( ui32Fcfg1Revision >= 0x00000020 ) {
      fcfg1Data = HWREG( FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1 );
      getTrimForXoschfCtlValue =
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_M ) >>
             FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_S ) <<
           DDI_0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_S);

      getTrimForXoschfCtlValue |=
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_M ) >>
             FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_S ) <<
           DDI_0_OSC_XOSCHFCTL_HP_BUF_ITRIM_S);

      getTrimForXoschfCtlValue |=
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_M ) >>
             FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_S ) <<
           DDI_0_OSC_XOSCHFCTL_LP_BUF_ITRIM_S);
   }

   return ( getTrimForXoschfCtlValue );
}

//*****************************************************************************
//
//! Returns the trim value to be used as OSC_DIG:CTL1.XOSC_HF_FAST_START
//
//*****************************************************************************
static uint32_t
GetTrimForXoscHfFastStart( uint32_t ui32Fcfg1Revision )
{
   uint32_t ui32XoscHfFastStartValue   ;

